tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "oven-sh/bun"
brew "openssl@3"
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "neovim"
brew "node"
brew "readline"
brew "pyenv"
brew "sqlite"
brew "xz"
brew "ripgrep"
brew "rustup-init"
brew "starship"
brew "stow"
brew "tcl-tk"
brew "wget"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "epic-games"
cask "godot"
cask "lm-studio"
cask "notion"
cask "obsidian"
cask "postman"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "wezterm"
vscode "catppuccin.catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "rust-lang.rust-analyzer"
vscode "tauri-apps.tauri-vscode"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
