tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "bat"
brew "glib"
brew "cocoapods"
brew "docker-compose"
brew "eza"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "lua"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "python@3.12"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "starship"
brew "stow"
brew "tree"
brew "wget"
brew "xcodegen"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "gcloud-cli"
cask "hammerspoon"
cask "ngrok"
cask "notion"
cask "sf-symbols"
cask "spotify"
cask "temurin"
cask "visual-studio-code"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "kamikillerto.vscode-colorize"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "miguelsolorio.symbols"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cpptools"
vscode "openai.chatgpt"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
