tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
brew "lazygit"
brew "llvm"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "ripgrep"
brew "rustup-init"
brew "starship"
brew "stow"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "epic-games"
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "notion"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.mono-debug"
vscode "vadimcn.vscode-lldb"
vscode "xaver.clang-format"
