tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "docker"
brew "docker-compose"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "obsidian"
cask "wezterm"